package by.training.java_intro.s02_algoritmization.t02_multidimensional_array;

/*
Найти положительные элементы главной диагонали квадратной матрицы.
 */
public class Task10 {
	public static void main(String[] args) {
		int[][] array = { { 80, 74, -61, -53, -61, -42, 78, -70, 67, 90 },
				{ -74, 54, 55, -65, -16, -59, -81, 7, 20, -27 }, { 32, -14, -9, 17, 94, 73, 72, -19, 9, 38 },
				{ -86, 55, 2, -2, -32, 50, -73, 61, -8, -8 }, { -94, 4, -98, -61, 48, -71, -55, 40, 85, 99 },
				{ -14, 24, -28, -17, 32, 20, 68, 20, 17, -43 }, { -33, -63, -13, 70, -20, 54, -87, -42, -52, -99 },
				{ 57, 70, 81, -10, 10, 99, 82, 73, 90, 80 }, { -36, -20, 13, 43, 67, -15, 35, 82, -74, -94 },
				{ -56, -14, -80, 44, -57, 44, -70, 61, 40, -44 } };

		System.out.print("Положительные элементы главной диагонали: ");
		for (int i = 0; i < array.length; i++) {
			if (array[i][i] > 0)
				System.out.print(array[i][i] + " ");
		}
	}
}
